Bartchez/quad-stm32/Program/_Application/main.c
	/* DMA1 clock enable */	 
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

	// ADCCLK = PCLK2/4 = 56 MHz /4 = 14 MHz (maksymalna mozliwa)
    RCC_ADCCLKConfig(RCC_PCLK2_Div4);  

#endif 

#ifdef PILOT 
	/* SPI2 clock enable */ 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE); 
#endif 

} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void NVIC_Configuration(void)  
{ 
	NVIC_InitTypeDef NVIC_InitStructure; 
 
#ifdef  VECT_TAB_RAM 
  /* Set the Vector Table base location at 0x20000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */ 
  /* Set the Vector Table base location at 0x08000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0); 
#endif 
 
 
	/* NVIC for rfm12 */ 
 
	//Konfiguracja NVIC - ustawienia priorytetow przerwania EXT0 
	//Wybor modelu grupowania przerwan 
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0); 

#ifdef PILOT 	 
	//Wybor konfigurowanego IRQ 
	NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn; 
#else
	//Wybor konfigurowanego IRQ 
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn; 
#endif
	 
	//Priorytet grupowy 
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; 
	//Podpriorytet 
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; 
	//Wlaczenie obslugi IRQ 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure); 
 

	/* NVIC for TIM1 */ 

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1); 

  	//przerwanie UP (przepelnienie) timera1
    NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
  	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  	NVIC_Init(&NVIC_InitStructure);

 
	/* NVIC for GPS */ 
 
#ifdef QUAD 
	// Wybranie grupy priorytetów  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);  
 
	// Wlacz przerwanie od USART2  
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;  
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;  
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  
	NVIC_Init(&NVIC_InitStructure);  
#endif 

} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void EXTI_Configuration(void)  
{ 
 
	/* EXTI for rfm12 */ 
	EXTI_InitTypeDef EXTI_InitStructure; 

#ifdef QUAD 
	//Ustawienia zrodla przerwania 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource9); 

	//Wybor lini 
	EXTI_InitStructure.EXTI_Line = EXTI_Line9; 
#else
	//Ustawienia zrodla przerwania 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource0); 

	//Wybor lini 
	EXTI_InitStructure.EXTI_Line = EXTI_Line0; 
#endif
	 
	//Ustawienie generowania przerwania 
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt; 
	 
	//Wyzwalanie zboczem opadajacym 
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; 
	 
	//Wlaczenie przerwania 
	EXTI_InitStructure.EXTI_LineCmd = ENABLE; 
	EXTI_Init(&EXTI_InitStructure);	 
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void SPI_Configuration(void) { 
 
	SPI_InitTypeDef SPI_InitStructure;  
 
	/* SPI for rfm12 */ 

	// Konfiguracja SPI 
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex; 
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master; 
//	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b; 
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b; 
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low; 
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge; 
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft; 
//	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32; 
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; 
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB; 
	SPI_InitStructure.SPI_CRCPolynomial = 7; 
	SPI_Init(RFM12_SPI, &SPI_InitStructure); 
	SPI_Cmd(RFM12_SPI, ENABLE);  

#ifdef PILOT
	
	/* SPI for SD */ 

	// Konfiguracja SPI
	SPI_InitStructure.SPI_Direction =  SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;              
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;  
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SD_SPI, &SPI_InitStructure);   
    SPI_Cmd(SD_SPI, ENABLE);


	/* SPI for LCD */ 

	// Konfiguracja SPI
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial= 7;
    SPI_Init(LCD_SPI, &SPI_InitStructure);
    SPI_Cmd(LCD_SPI, ENABLE);

#endif
} 
 
//////////////////////////////////////////////////////////////////////////////////////////////////// 
void USART_Configuration(void) { 
	USART_InitTypeDef USART_InitStructure;  
 
 	// dlugosc slowa = 8 bitow 
	USART_InitStructure.USART_WordLength = USART_WordLength_8b; 
	// 1 bit stopu 
	USART_InitStructure.USART_StopBits = USART_StopBits_1; 
	// Brak kontroli parzystosci 
	USART_InitStructure.USART_Parity = USART_Parity_No; 
	// Kontrola przeplywu danych wylaczona 
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; 
 
 
	/* USART for GPS */ 
 
#ifdef QUAD 
	// reset 
	USART_DeInit(GPS_USART); 
 	// predkosc transmisji = 9600 
 	USART_InitStructure.USART_BaudRate = 9600; 
	//Tryb pracy (Rx - odbior, Tx - nadawanie) 
	USART_InitStructure.USART_Mode = USART_Mode_Rx; 
 
